#include <iostream>
#include <queue> // черга

using namespace std;
int main()
{
    queue<int> Queue;
    int mas[7][7] = {
        { 0, 1, 1, 0, 0, 0, 1 }, // матрицяя суміжності
        { 1, 0, 1, 1, 0, 0, 0 },
        { 1, 1, 0, 0, 0, 0, 0 },
        { 0, 1, 0, 0, 1, 0, 0 },
        { 0, 0, 0, 1, 0, 1, 0 },
        { 0, 0, 0, 0, 1, 0, 1 },
        { 1, 0, 0, 0, 0, 1, 0 } };
    int nodes[7]; // вершини графа
    for (int i = 0; i < 7; i++)
        nodes[i] = 0; // всі вершини рівні 0
    Queue.push(0); // поміщаемо в чергу першу вершину
    while (!Queue.empty())
    { // пока черга не порожня
        int node = Queue.front(); // дістаємо вершину
        Queue.pop();
        nodes[node] = 2; // відмічаемо її як відвідану

        for (int j = 0; j < 7; j++)
        { // перевіряємо для неї всі суміжні вершини
            if (mas[node][j] == 1 && nodes[j] == 0)
            { // якщо вершина суміжна і не знайдена
                Queue.push(j); // додаємо її в чергу
                nodes[j] = 1; // відмічаємо вершину як знайдену
            }
        }
        cout << node + 1 << endl; // виводимо номер вершини
    }

    cin.get();
    return 0;
}
